[
    {
        "_id": "CS1234",
        "name": "React JS",
        "number": "RS4550",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D123",
        "credits": 4,
        "img": "/images/reactjs.png",
        "description": "This course provides a comprehensive introduction to React.js, a popular JavaScript library for building modern web applications. Topics include components, props, state management, hooks, context API, and React Router. Students will work on hands-on projects to develop dynamic and scalable front-end applications."
    },
    {
        "_id": "CS1000",
        "name": "Node JS",
        "number": "RS4560",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D123",
        "credits": 4,
        "img": "/images/node.png",
        "description": "This course covers the fundamentals of Node.js, an asynchronous event-driven JavaScript runtime used for building scalable network applications. Topics include the Node.js event loop, file system interactions, Express.js for backend development, authentication, and deploying Node.js applications."
    },
    {
        "_id": "CS1001",
        "name": "Angular JS",
        "number": "RS4570",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D123",
        "credits": 4,
        "img": "/images/angularjs.png",
        "description": "This course introduces Angular.js, a JavaScript framework for building dynamic web applications. It covers directives, controllers, services, dependency injection, two-way data binding, and component-based architecture. Students will develop interactive single-page applications using Angular."
    },
    {
        "_id": "CS1002",
        "name": "Vue JS",
        "number": "CH1230",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D134",
        "credits": 4,
        "img": "/images/vuejs.png",
        "description": "This course provides an introduction to Vue.js, a progressive JavaScript framework for building user interfaces. Topics include Vue components, directives, event handling, Vuex for state management, and Vue Router for navigation. Hands-on projects will help students master front-end development with Vue.js."
    },
    {
        "_id": "CS1003",
        "name": "Express JS",
        "number": "CH1240",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D134",
        "credits": 4,
        "img": "/images/expressjs.png",
        "description": "This course focuses on Express.js, a fast and minimalist web framework for Node.js. Students will learn to create RESTful APIs, handle middleware, manage authentication, integrate with databases, and deploy Express applications on cloud platforms."
    },
    {
        "_id": "CS1004",
        "name": "Mongo DB",
        "number": "CH1250",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "D134",
        "credits": 4,
        "img": "/images/mongodb.png",
        "description": "This course covers MongoDB, a NoSQL database used for high-performance applications. Topics include document-based data modeling, CRUD operations, indexing, aggregation pipelines, and integrating MongoDB with Node.js applications."
    },
    {
        "_id": "CS1005",
        "name": "AWS",
        "number": "ME101",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "Cloud Computing",
        "credits": 4,
        "img": "/images/aws.png",
        "description": "This course provides an overview of Amazon Web Services (AWS), covering cloud computing fundamentals, core AWS services (EC2, S3, RDS, Lambda), security best practices, and cost optimization. Students will work on hands-on labs to deploy and manage cloud applications using AWS."
    },
    {
        "_id": "CS1006",
        "name": "DevOps",
        "number": "ME102",
        "startDate": "2023-01-10",
        "endDate": "2023-05-15",
        "department": "Software Engineering",
        "credits": 4,
        "img": "/images/devops.jpeg",
        "description": "This course introduces DevOps principles, focusing on automation, CI/CD pipelines, infrastructure as code, containerization with Docker, Kubernetes orchestration, monitoring, and security best practices. Students will gain hands-on experience in deploying scalable applications."
    }
]